Revit 2027 API
ImageExportOptions.HLRandWFViewsFileType Property
 File type for exported HLR and wireframe views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageFileType HLRandWFViewsFileType { get; set; }
Public Property HLRandWFViewsFileType As ImageFileType
	Get
	Set
public:
property ImageFileType HLRandWFViewsFileType {
	ImageFileType get ();
	void set (ImageFileType value);
}
member HLRandWFViewsFileType : ImageFileType with get, set
Property Value
ImageFileType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default is JPEGMedium. This field is ignored if used to save an image to a project as a new view.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace